---
kind: method
id: M:Autodesk.Revit.DB.FilterNumericValueRule.SetEvaluator(Autodesk.Revit.DB.FilterNumericRuleEvaluator)
source: html/c25e182c-e2da-02a8-e3b5-db67da6a62cf.htm
---
# Autodesk.Revit.DB.FilterNumericValueRule.SetEvaluator Method

Sets the evaluator that implements the test for this rule.

## Syntax (C#)
```csharp
public void SetEvaluator(
	FilterNumericRuleEvaluator evaluator
)
```

## Parameters
- **evaluator** (`Autodesk.Revit.DB.FilterNumericRuleEvaluator`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null